Vladimir-Trufanov/ittve-ESP32-CAM/08-camerawebserver/CameraWebServer202/app_httpd.cpp
// (рус) Copyright 2015-2016 Espressif Systems 2.0.2 (Shanghai) PTE LTD
//
// Лицензирован по лицензии Apache версии 2.0 ("Лицензия"); 
// вы можете использовать этот файл только в соответствии с Лицензией.  
// Вы можете получить копию Лицензии по адресу http://www.apache.org/licenses/LICENSE-2.0
// за исключением случаев, предусмотренных действующим законодательством или оговоренных в письменной форме, 
// программное обеспечение, распространяемое по Лицензии, распространяется на УСЛОВИЯХ "КАК ЕСТЬ", 
// БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ, явных или подразумеваемых. Сведения о конкретном языке, 
// регулирующем разрешения и ограничения в соответствии с Лицензией, приведены в Лицензии.

#include "arduino.h"
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "driver/ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"

#include "esp32-hal-log.h"
static const char *TAG = "camera_httpd";

#define CONFIG_RLOG_PROJECT_LEVEL RLOG_LEVEL_VERBOSE  // выводим сообщения всех уровней
#define CONFIG_RLOG_SHOW_TIMESTAMP 0                  // не выводим отметок времени
#define CONFIG_RLOG_SHOW_FILEINFO 0                   // не выводим отметку о месте сообщения в скетче
#include "rLog.h"                                      
static const char* rl = "CamWeb";                     // указали тег сообщений

#if CONFIG_ESP_FACE_DETECT_ENABLED
  #include "fd_forward.h"
  #if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    #include "fr_forward.h"
    #define ENROLL_CONFIRM_TIMES 5
    #define FACE_ID_SAVE_NUMBER 7
  #endif

  #define FACE_COLOR_WHITE 0x00FFFFFF
  #define FACE_COLOR_BLACK 0x00000000
  #define FACE_COLOR_RED 0x000000FF
  #define FACE_COLOR_GREEN 0x0000FF00
  #define FACE_COLOR_BLUE 0x00FF0000
  #define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
  #define FACE_COLOR_CYAN (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
  #define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
  int led_duty = 0;
  bool isStreaming = false;
  #ifdef CONFIG_LED_LEDC_LOW_SPEED_MODE
    #define CONFIG_LED_LEDC_SPEED_MODE LEDC_LOW_SPEED_MODE
  #else
    #define CONFIG_LED_LEDC_SPEED_MODE LEDC_HIGH_SPEED_MODE
  #endif
#endif

typedef struct
{
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

/**
 * Инициируем httpd_handle_t - дескрипторы потокового сервера (stream_httpd) и сервера камеры (camera_httpd).
 * Тип httpd_handle_t предоставляется для управления экземпляром HTTP-сервера, который получает запросы от клиентов и отправляет ответы. 
 * 
 * Структура
 * Хотя формально тип httpd_handle_t не является типом указателя, его определение — typedef void * httpd_handle_t. Это означает, 
 * что дескриптор сервера — по сути, указатель. 
 * 
 * Использование
 * После создания дескриптор сервера используется для всех операций сервера, например: 
 * регистрация URI-обработчиков. Каждый обработчик (URI handler) привязывается к определённому URI и HTTP-методу (GET, POST и т. п.). 
 * Функция обработчика вызывается всякий раз, когда поступает запрос, соответствующий URI и методу. 
 * 
 * Остановка сервера. 
 * Функция httpd_stop() останавливает сервер по предоставленному дескриптору и освобождает любые выделенные для него ресурсы и память. 
 * При остановке задача закрывает все открытые соединения, удаляет зарегистрированные обработчики URI 
 * и сбрасывает все данные контекста сеанса в пустое состояние. 
 * 
 * URI-обработчики с использованием httpd_handle_t регистрируются с помощью функции httpd_register_uri_handler. 
 * При регистрации обработчика передаётся объект типа структуры httpd_uri_t. В ней заполняются следующие поля:
 * uri — имя ссылки (например, /hello, /data, /* для wildcard).
 * method — тип метода (например, HTTP_GET, HTTP_POST, HTTP_PUT, HTTP_DELETE).
 * handler — указатель на функцию C, которая будет обрабатывать запросы, соответствующие URI и методу.
 * user_ctx — указатель на пользовательские контекстные данные, которые будут переданы в функцию обработчика.
 * 
 * Пример использования: 
 * 
 * esp_err_t my_uri_handler(httpd_req_t *req) 
 * {
 *   // Обработка запроса
 *   ...
 *   // Возврат ESP_OK, если запрос был успешно обработан
 *   return ESP_OK;
 *   // Возврат кода ошибки, чтобы закрыть соединение
 *   return ESP_FAIL;
 * }
 * 
 * void register_uri_handlers(httpd_handle_t server) 
 * {
 *   httpd_uri_t my_uri = 
 *   {
 *     .uri = "/my_uri",
 *     .method = HTTP_GET,
 *     .handler = my_uri_handler,
 *     .user_ctx = NULL
 *   };
 *   httpd_register_uri_handler(server, &my_uri);
 * }
 * 
 * В этом примере говорится серверу: «Когда приходит HTTP-запрос с методом GET на путь /api/data — 
 * вызови вот мою функцию-обработчик». Функция обработчика должна вернуть значение **esp_err_t**.
**/
httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#if CONFIG_ESP_FACE_DETECT_ENABLED
  static int8_t detection_enabled = 0;
  static mtmn_config_t mtmn_config = {0};
  #if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    static int8_t recognition_enabled = 0;
    static int8_t is_enrolling = 0;
    static face_id_list id_list = {0};
  #endif
#endif
// ****************************************************************************
// * Взять указатель на структуру ra_filter_t и размер выборки (sample_size), *
// *    использовать поля структуры ra_filter_t для инициализации значений    *
// ****************************************************************************
typedef struct
{
    size_t size;  // количество значений, используемых для фильтрации
    size_t index; // текущее значение индекса
    size_t count; // количество значений
    int sum;
    int *values;  // массив, который должен быть заполнен значениями
} ra_filter_t;

