Vladimir-Trufanov/ittve-ESP32-CAM/08-camerawebserver/CameraWebServer202/app_httpd.cpp
  httpd_uri_t index_uri = 
  {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
  };

  httpd_uri_t status_uri = 
  {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
  };

  httpd_uri_t cmd_uri = 
  {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
  };

  httpd_uri_t capture_uri = 
  {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
  };

  httpd_uri_t stream_uri = 
  {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
  };

  httpd_uri_t bmp_uri = 
  {
    .uri = "/bmp",
    .method = HTTP_GET,
    .handler = bmp_handler,
    .user_ctx = NULL
  };

  httpd_uri_t xclk_uri = 
  {
    .uri = "/xclk",
    .method = HTTP_GET,
    .handler = xclk_handler,
    .user_ctx = NULL
  };

  httpd_uri_t reg_uri = 
  {
    .uri = "/reg",
    .method = HTTP_GET,
    .handler = reg_handler,
    .user_ctx = NULL
  };

  httpd_uri_t greg_uri = 
  {
    .uri = "/greg",
    .method = HTTP_GET,
    .handler = greg_handler,
    .user_ctx = NULL
  };

  httpd_uri_t pll_uri = 
  {
    .uri = "/pll",
    .method = HTTP_GET,
    .handler = pll_handler,
    .user_ctx = NULL
  };

  httpd_uri_t win_uri = 
  {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
  };

  // Инициируем структуру фильтрации
  ra_filter_init(&ra_filter, 20);
  // Инициируем параметры распознавания лиц
  #if CONFIG_ESP_FACE_DETECT_ENABLED
    mtmn_config.type = FAST;
    mtmn_config.min_face = 80;
    mtmn_config.pyramid = 0.707;
    mtmn_config.pyramid_times = 4;
    mtmn_config.p_threshold.score = 0.6;
    mtmn_config.p_threshold.nms = 0.7;
    mtmn_config.p_threshold.candidate_number = 20;
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 10;
    mtmn_config.o_threshold.score = 0.7;
    mtmn_config.o_threshold.nms = 0.7;
    mtmn_config.o_threshold.candidate_number = 1;
    #if CONFIG_ESP_FACE_RECOGNITION_ENABLED
      face_id_init(&id_list, FACE_ID_SAVE_NUMBER, ENROLL_CONFIRM_TIMES);
    #endif
  #endif

  // Стартуем HTTP-сервер камеры
  /** 
   * Стартуем HTTP-сервер: esp_err_t httpd_start(httpd_handle_t *handle, const httpd_config_t *config):
   * создаём экземпляр HTTP-сервера, выделяет ему память/ресурсы в зависимости от заданной конфигурации
   * и выдаёт дескриптор экземпляру сервера.
   * 
   * На сервере имеется прослушивающий сокет (TCP) для HTTP-трафика и управляющий сокет (UDP) 
   * для управляющих сигналов, которые выбираются циклически (по алгоритму round robin) 
   * в цикле задач сервера (server task loop). 
   * Приоритет задачи сервера и размер её стека конфигурируются во время создания 
   * экземпляра сервера путем передачи структуры httpd_config_t в вызов httpd_start().
   * 
   * TCP-трафик обрабатывается как HTTP-запросы, и, в зависимости от запрошенного URI, 
   * вызываются зарегистрированные пользователем обработчики, которые должны 
   * отправлять HTTP-пакеты ответов.
   * 
   * Example usage:
   * // Функция для запуска веб-сервера
   * httpd_handle_t start_webserver(void)
   * {
   *   // Генерируем конфигурацию по умолчанию
   *   httpd_config_t config = HTTPD_DEFAULT_CONFIG();
   *   // Инициируем пустой дескриптор http_server
   *   (если сервер не запуститься, вернем дескриптор равный NULL)
   *   httpd_handle_t server = NULL;
   *   // Запускаем httpd-сервер и получаем дескриптор
   *   if (httpd_start(&server, &config) == ESP_OK) 
   *   {
   *     // Регистрируем обработчики URI
   *     httpd_register_uri_handler(server, &uri_get);
   *     httpd_register_uri_handler(server, &uri_post);
   *   }
   *   // Возвращаем реальный дескриптор или NULL, если серверу не удалось запуститься
   *   return server;
   * }
   * 
   * Parameters:
   *   config -- [in]  конфигурация для нового экземпляра сервера
   *   handle -- [out] дескриптор вновь созданного экземпляра сервера. NULL в случае ошибки
   *   
   * Returns
   * 
   * ESP_OK                  - экземпляр успешно создан
   * ESP_ERR_INVALID_ARG     - недопустимый аргумент(ы)
   * ESP_ERR_HTTPD_ALLOC_MEM - не удалось выделить память для экземпляра
   * ESP_ERR_HTTPD_TASK      - не удалось запустить серверную задачу
  **/
  rlog_i(rl, "Стартуется сервер камеры на порту: %d",config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK)
  {
    // Регистрируем URI-обработчики страниц с использованием httpd_handle_t 
    // с помощью функции httpd_register_uri_handler. 
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
  }
  // Стартуем потоковый сервер
  config.server_port += 1;
  config.ctrl_port += 1;
  rlog_i(rl, "Стартуется потоковый сервер на порту: %d",config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK)
  {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}
